ch11/ch11-4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 Thu 10:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 11.4</title>
<meta name="author" content="pedh" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Chapter 11.4</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb06de56">ch11.4</a>
<ul>
<li><a href="#org9794bfb">11.4-1</a></li>
<li><a href="#orgeb185f1">11.4-2</a></li>
<li><a href="#org46fffa4">11.4-3</a></li>
<li><a href="#org38727ab">11.4-4</a></li>
<li><a href="#orgff0c250">11.4-5</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb06de56" class="outline-2">
<h2 id="orgb06de56">ch11.4</h2>
<div class="outline-text-2" id="text-orgb06de56">
</div>
<div id="outline-container-org9794bfb" class="outline-3">
<h3 id="org9794bfb">11.4-1</h3>
<div class="outline-text-3" id="text-org9794bfb">
<pre class="example">
1. line probing
h(10, 0) = 10
|---+---+---+---+---+---+---+---+---+---+----|
| 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|---+---+---+---+---+---+---+---+---+---+----|
|   |   |   |   |   |   |   |   |   |   | 10 |
|---+---+---+---+---+---+---+---+---+---+----|

h(22, 0) = 0
|----+---+---+---+---+---+---+---+---+---+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|----+---+---+---+---+---+---+---+---+---+----|
| 22 |   |   |   |   |   |   |   |   |   | 10 |
|----+---+---+---+---+---+---+---+---+---+----|

h(31, 0) = 9
|----+---+---+---+---+---+---+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|
| 22 |   |   |   |   |   |   |   |   | 31 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|

h(4, 0) = 4
|----+---+---+---+---+---+---+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|
| 22 |   |   |   | 4 |   |   |   |   | 31 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|

h(15, 0) = 4
h(15, 1) = 5
|----+---+---+---+---+----+---+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 |  5 | 6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+----+---+---+---+----+----|
| 22 |   |   |   | 4 | 15 |   |   |   | 31 | 10 |
|----+---+---+---+---+----+---+---+---+----+----|

h(28, 0) = 6
|----+---+---+---+---+----+----+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 |  5 |  6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+----+----+---+---+----+----|
| 22 |   |   |   | 4 | 15 | 28 |   |   | 31 | 10 |
|----+---+---+---+---+----+----+---+---+----+----|

h(17, 0) = 6
h(17, 1) = 7
|----+---+---+---+---+----+----+----+---+----+----|
|  0 | 1 | 2 | 3 | 4 |  5 |  6 |  7 | 8 |  9 | 10 |
|----+---+---+---+---+----+----+----+---+----+----|
| 22 |   |   |   | 4 | 15 | 28 | 17 |   | 31 | 10 |
|----+---+---+---+---+----+----+----+---+----+----|

h(88, 0) = 0
h(88, 1) = 1
|----+----+---+---+---+----+----+----+---+----+----|
|  0 |  1 | 2 | 3 | 4 |  5 |  6 |  7 | 8 |  9 | 10 |
|----+----+---+---+---+----+----+----+---+----+----|
| 22 | 88 |   |   | 4 | 15 | 28 | 17 |   | 31 | 10 |
|----+----+---+---+---+----+----+----+---+----+----|

h(59, 0) = 4
h(59, 1) = 5
h(59, 2) = 6
h(59, 3) = 7
h(59, 4) = 8
|----+----+---+---+---+----+----+----+----+----+----|
|  0 |  1 | 2 | 3 | 4 |  5 |  6 |  7 |  8 |  9 | 10 |
|----+----+---+---+---+----+----+----+----+----+----|
| 22 | 88 |   |   | 4 | 15 | 28 | 17 | 59 | 31 | 10 |
|----+----+---+---+---+----+----+----+----+----+----|

2. quadratic probing
h(10, 0) = 10
|---+---+---+---+---+---+---+---+---+---+----|
| 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|---+---+---+---+---+---+---+---+---+---+----|
|   |   |   |   |   |   |   |   |   |   | 10 |
|---+---+---+---+---+---+---+---+---+---+----|

h(22, 0) = 0
|----+---+---+---+---+---+---+---+---+---+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|----+---+---+---+---+---+---+---+---+---+----|
| 22 |   |   |   |   |   |   |   |   |   | 10 |
|----+---+---+---+---+---+---+---+---+---+----|

h(31, 0) = 9
|----+---+---+---+---+---+---+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|
| 22 |   |   |   |   |   |   |   |   | 31 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|

h(4, 0) = 4
|----+---+---+---+---+---+---+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|
| 22 |   |   |   | 4 |   |   |   |   | 31 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|

h(15, 0) = 4
h(15, 1) = 8
|----+---+---+---+---+---+---+---+----+----+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 |  8 |  9 | 10 |
|----+---+---+---+---+---+---+---+----+----+----|
| 22 |   |   |   | 4 |   |   |   | 15 | 31 | 10 |
|----+---+---+---+---+---+---+---+----+----+----|

h(28, 0) = 6
|----+---+---+---+---+---+----+---+----+----+----|
|  0 | 1 | 2 | 3 | 4 | 5 |  6 | 7 |  8 |  9 | 10 |
|----+---+---+---+---+---+----+---+----+----+----|
| 22 |   |   |   | 4 |   | 28 |   | 15 | 31 | 10 |
|----+---+---+---+---+---+----+---+----+----+----|

h(17, 0) = 6
h(17, 1) = 10
h(17, 2) = 9
h(17, 3) = 3
|----+---+---+----+---+---+----+---+----+----+----|
|  0 | 1 | 2 |  3 | 4 | 5 |  6 | 7 |  8 |  9 | 10 |
|----+---+---+----+---+---+----+---+----+----+----|
| 22 |   |   | 17 | 4 |   | 28 |   | 15 | 31 | 10 |
|----+---+---+----+---+---+----+---+----+----+----|

h(88, 0) = 0
h(88, 1) = 4
h(88, 2) = 3
h(88, 3) = 8
h(88, 4) = 8
h(88, 5) = 3
h(88, 6) = 4
h(88, 7) = 0
h(88, 8) = 2
|----+---+----+----+---+---+----+---+----+----+----|
|  0 | 1 |  2 |  3 | 4 | 5 |  6 | 7 |  8 |  9 | 10 |
|----+---+----+----+---+---+----+---+----+----+----|
| 22 |   | 88 | 17 | 4 |   | 28 |   | 15 | 31 | 10 |
|----+---+----+----+---+---+----+---+----+----+----|


h(59, 0) = 4
h(59, 1) = 8
h(59, 2) = 7
|----+---+----+----+---+---+----+----+----+----+----|
|  0 | 1 |  2 |  3 | 4 | 5 |  6 |  7 |  8 |  9 | 10 |
|----+---+----+----+---+---+----+----+----+----+----|
| 22 |   | 88 | 17 | 4 |   | 28 | 59 | 15 | 31 | 10 |
|----+---+----+----+---+---+----+----+----+----+----|


3. double hashing
h(10, 0) = 10
|---+---+---+---+---+---+---+---+---+---+----|
| 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|---+---+---+---+---+---+---+---+---+---+----|
|   |   |   |   |   |   |   |   |   |   | 10 |
|---+---+---+---+---+---+---+---+---+---+----|

h(22, 0) = 0
|----+---+---+---+---+---+---+---+---+---+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|----+---+---+---+---+---+---+---+---+---+----|
| 22 |   |   |   |   |   |   |   |   |   | 10 |
|----+---+---+---+---+---+---+---+---+---+----|

h(31, 0) = 9
|----+---+---+---+---+---+---+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|
| 22 |   |   |   |   |   |   |   |   | 31 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|

h(4, 0) = 4
|----+---+---+---+---+---+---+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|
| 22 |   |   |   | 4 |   |   |   |   | 31 | 10 |
|----+---+---+---+---+---+---+---+---+----+----|

h(15, 0) = 4
h(15, 1) = 10
h(15, 2) = 5
|----+---+---+---+---+----+---+---+---+----+----|
|  0 | 1 | 2 | 3 | 4 |  5 | 6 | 7 | 8 |  9 | 10 |
|----+---+---+---+---+----+---+---+---+----+----|
| 22 |   |   |   | 4 | 15 |   |   |   | 31 | 10 |
|----+---+---+---+---+----+---+---+---+----+----|

h(28, 0) = 6
h(28, 1) = 4
h(28, 2) = 2
|----+---+----+---+---+----+---+---+---+----+----|
|  0 | 1 |  2 | 3 | 4 |  5 | 6 | 7 | 8 |  9 | 10 |
|----+---+----+---+---+----+---+---+---+----+----|
| 22 |   | 28 |   | 4 | 15 |   |   |   | 31 | 10 |
|----+---+----+---+---+----+---+---+---+----+----|

h(17, 0) = 6
h(17, 1) = 3
|----+---+----+----+---+----+---+---+---+----+----|
|  0 | 1 |  2 |  3 | 4 |  5 | 6 | 7 | 8 |  9 | 10 |
|----+---+----+----+---+----+---+---+---+----+----|
| 22 |   | 28 | 17 | 4 | 15 |   |   |   | 31 | 10 |
|----+---+----+----+---+----+---+---+---+----+----|

h(88, 0) = 0
h(88, 1) = 9
h(88, 2) = 7
|----+---+----+----+---+----+---+----+---+----+----|
|  0 | 1 |  2 |  3 | 4 |  5 | 6 |  7 | 8 |  9 | 10 |
|----+---+----+----+---+----+---+----+---+----+----|
| 22 |   | 28 | 17 | 4 | 15 |   | 88 |   | 31 | 10 |
|----+---+----+----+---+----+---+----+---+----+----|

h(59, 0) = 4
h(59, 1) = 3
h(59, 2) = 2
h(59, 3) = 1
|----+----+----+----+---+----+---+----+---+----+----|
|  0 |  1 |  2 |  3 | 4 |  5 | 6 |  7 | 8 |  9 | 10 |
|----+----+----+----+---+----+---+----+---+----+----|
| 22 | 59 | 28 | 17 | 4 | 15 |   | 88 |   | 31 | 10 |
|----+----+----+----+---+----+---+----+---+----+----|
</pre>
</div>
</div>
<div id="outline-container-orgeb185f1" class="outline-3">
<h3 id="orgeb185f1">11.4-2</h3>
<div class="outline-text-3" id="text-orgeb185f1">
<pre class="example">
HASH-DELETE(T, k)
    i = HASH-SEARCH(k)
    if i != NIL
        T[i] = DELETED

HASH-INSERT(T, k)
    i = 0
    repeat
        j = h(k, i)
        if T[j] == NIL or T[j] == DELETED
            T[j] = k
            return j
        else i = i + 1
    until i == m
    error "hash table overflow"
</pre>
</div>
</div>
<div id="outline-container-org46fffa4" class="outline-3">
<h3 id="org46fffa4">11.4-3</h3>
<div class="outline-text-3" id="text-org46fffa4">
<p>
When the load factor is \(3 / 4\), the upper bound on the expected number of
probes in an unsuccessful search is \(4\), the upper bound on the expected
number of probes in a successful search is \(\frac{4\ln4}{3}\approx 1.848\).
</p>

<p>
When the load factor is \(7 / 8\), the upper bound on the expected number of
probes in an unsuccessful search is \(8\), the upper bound on the expected
number of probes in a successful search is \(\frac{8\ln8}{7}\approx 2.377\).
</p>
</div>
</div>
<div id="outline-container-org38727ab" class="outline-3">
<h3 id="org38727ab">11.4-4</h3>
<div class="outline-text-3" id="text-org38727ab">
<p>
From theorem 31.24, we know that the equation \(ih_2(k)\equiv 0\pmod{m}\) has
exactly \(d\) distinct solutions, modulo m, given by \(i_k = k(m/d)\) for
\(k=0,1,\dots,d-1\), thus the first unsuccessful search appears when
\(i=m/d\), which means \(1/d\)th of the hash table was examined before
returning to slot \(h_1(k)\). Thus, when \(d=1\), the search may examine the
entire table.
</p>
</div>
</div>
<div id="outline-container-orgff0c250" class="outline-3">
<h3 id="orgff0c250">11.4-5</h3>
<div class="outline-text-3" id="text-orgff0c250">
<p>
To find the nonzero value \(\alpha\) for which the expected number of probes
in an unsuccessful search equals twice the expected number of probes in a
successful search, we need to solve the equation below.
</p>
\begin{align*}
\frac{1}{1-\alpha}=\frac{2}{\alpha}\ln\frac{1}{1-\alpha}
\end{align*}
<p>
To solve the equation, we need to use the <b>Lambert W function</b>, which is the
inverse function of \(f(w) = w\mathrm{e}^w\).
</p>
\begin{align*}
&\frac{1}{1-\alpha}=\frac{2}{\alpha}\ln\frac{1}{1-\alpha}\\
\implies&\mathrm{e}^{\frac{\alpha}{2(1-\alpha)}}=\frac{1}{1-\alpha}\\
\implies&-\frac{1}{2}\mathrm{e}^{-\frac{1}{2}}=\frac{1}{2(\alpha-1)}
\mathrm{e}^{\frac{1}{2(\alpha-1)}}\\
\implies&\frac{1}{2(\alpha-1)}=W(-\frac{1}{2}\mathrm{e}^{-\frac{1}{2}})
\end{align*}
<p>
Since \(-\frac{1}{\mathrm{e}}< -\frac{1}{2}\mathrm{e}^{-\frac{1}{2}}< 0\), we
could use two branches \(W_0\) and \(W_{-1}\) when dealing with real numbers
only, after calculation, we found the result \(\alpha \approx 0.7153\).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2023-08-17 Thu 10:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>